Revit 2027 API
HostObjectSubcomponentInfo.AreaOfCurveLoop Property
 The area of the CurveLoop of the roof or floor slab.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AreaOfCurveLoop { get; }
Public ReadOnly Property AreaOfCurveLoop As Double
	Get
public:
property double AreaOfCurveLoop {
	double get ();
}
member AreaOfCurveLoop : float with get
Property Value
Double
See Also
Reference
HostObjectSubcomponentInfo Class
Autodesk.Revit.DB.IFC Namespace